app/Controllers/CategoryController.php

    public function index()
    {
        $category = new CategoryModel();
        $data['items'] = $category->findAll();
---
SELECT *
FROM `category`

    public function store(){
        $data = [
            'category' => $this->request->getVar('category'),
        ];

        if($data){
            $this->category->insert($data);
---
INSERT INTO `category` (`category`) VALUES ('nabil')