app/Controllers/FrontendProductController.php

SELECT *
FROM `products`
---
    public function index()
    {
       $productmodel= new productmodel();
       $data = $productmodel->findAll();

SELECT *
FROM `products`
WHERE `id` = '2'
---
    public function show($id = null)
    {
        $model = new ProductModel();
        $data = $model->getWhere(['id' => $id])->getResult();