app/Controllers/LoginController.php

    public function login(){
       $session= session();
       $userModel =new UserModel();
      $email= $this->request->getvar('email');
      $formpass = $this->request->getvar('password');

    //   $formpass=password_hash($formpass,PASSWORD_DEFAULT);

     $data= $userModel->where('email',$email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'shikha@gmail.com'
 LIMIT 1