app/Controllers/ProductController.php

    public function index()
    {
        $data['items'] = $this->products->findAll();
---
SELECT *
FROM `products`

    public function create(){
        $this->products->join('category','category_id = products.category_id');
        $data['items'] = $this->category->findAll();
---
SELECT *
FROM `category`